rhoCentralFoamSim/rhoCentralFoamSim/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       sutherland;
    thermo          janaf;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       23.3;
    }
    thermodynamics
    {
        Tlow            200.000000;
        Thigh           6000.000000;
        Tcommon         1000.000000;
        highCpCoeffs    ( 2.7126 0.00167329 -5.38001e-07 8.05011e-11 -4.43908e-15 -6659.66 11.3647 );
        lowCpCoeffs     ( 2.78001 0.00111605 4.16932e-07 -4.59709e-10 7.06722e-14  -6662.4 11.1089 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}


// ************************************************************************* //
