rhoCentralFoamSim/rhoCentralFoamSim/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    object    controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoCentralFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5.0e-02;

deltaT          2e-06;

writeControl    runTime;

writeInterval   5e-05;

writeFormat     ascii;

writePrecision 6;

writeCompression off;

timeFormat	general;

timePrecision 	6;

runTimeModifiable true;

adjustTimeStep	  yes;

maxCo 		  0.5;

// ************************************************************************* //
